import java.io.IOException;
public class study06 {
	public static void main (String[] args) throws IOException{
		//次のプログラムを作成しなさい。
			//10 個の数値を入力する。
			//入力された各々の数値を 2 倍にして表示する。
		
		//次のプログラムを作成しなさい。
			//10 個の数値を入力する。
			//入力された順番と逆の順番で 10 個の数値を表示する。
		
		//次のプログラムを作成しなさい。
			//10 個の数値を入力する。
			//入力された数値を偶数と奇数に分類して表示する。
		
		//数値を繰り返して入力し、合計が 100 を超えた場合、または入力が 10 回行われた場合、
		//入力を止め入力された数値をすべて表示するプログラムを作成しなさい。
		
		//次のコードに追加し、入力された数値を 16 桁の２進数で表示するプログラムを完成させなさい。
		
		//次のコードに追加し、九九表を表示するプログラムを完成させなさい。
		
		//1 桁の数値（ 1 ～ 9 に限定）を２つ入力し、その積を表示するプログラムを作成しなさい。
		//ただし、九九の計算結果が入った配列を予め作成して利用すること。（前問を参考に）
		
		//整数を 10 回入力し、小さい順に並べ替えて表示するプログラムを作成しなさい。
	}

}
