//【練習問題】繰り返し
import java.io.IOException;

public class study05 {
	public static void main( String[] args ) throws IOException{
		//“SPAM”という単語を 10 回表示するプログラムを作成しなさい。

		
		//九九、三の段（ 3 ～ 27 の 3 の倍数）を表示するプログラムを作成しなさい。

		
		//2 の 1 乗から 8 乗までを計算し表示するプログラムを作成しなさい。

		
		//7 の階乗を計算し、表示するプログラムを作成しなさい。

		
		//整数を 10 回入力し、平均値を求めるプログラムを作成しなさい。

		
		//整数、0 か 1 を 10 回入力する。これを対戦成績と考え、0 を負け、1 を勝ちとして、勝ちの総数、負けの総数を表示するプログラムを作成しなさい。

		
		//次のプログラムを作成しなさい
			//巨人、阪神戦で毎回の得点を入力する。（１回～９回）
			//入力が終わったら、それぞれの得点とどちらが勝ったかを表示する。

		
		//自然数（正の整数）を 10 回入力し、最大値を求めるプログラムを作成しなさい。

				
		//整数を 10 回入力し、最大値と最小値を求めるプログラムを作成しなさい。

		
		//個数を示す数値を入力し、その個数分だけ‘*’を表示するプログラムを作成しなさい。

		
		//個数を示す数値を入力し、その個数分だけ 0 ～ 9 の数字を表示するプログラムを作成しなさい。数字は 0, 1, 2, 3, , の順に表示し、9 の次は 0 に戻るものとします。

		
		//数値を繰り返し入力し、合計が 100 を超えたら入力を止めて合計を表示するプログラムを作成しなさい。

		
		//ストライク・カウントを数えるプログラムを作成しなさい。
			//１球ごとにストライクかボールかを入力する。
			//３ストライクまたは４ボールになったら入力を止め、ストライクとボールのカウントを表示する。
		
		
		//前の問題に次の修正を加えなさい。
			//１球ごとにストライク、ボール、ファウルの何れかを入力する。（残念ながらヒットにはなりません）
			//ファウルの場合、２ストライクまではストライクにカウントするが、３ストライクにはならない。
			//３ストライクまたは４ボールになったら入力を止め、ストライクとボールのカウントを表示する。

		
		//入力された数が素数かどうかを判定するプログラムを作成しなさい。

		
		//2 以上の数値を入力し、素因数分解した結果を表示しなさい。

		
		//九九表（一の段～九の段）を表示するプログラムを作成しなさい。

		
		//数値を繰り返して入力し、0 が入力されたら入力を止め、それまでの合計を表示するプログラムを作成しなさい。

		
		//数値を繰り返して入力し、0 が入力されたら入力を止め、平均値を表示するプログラムを作成しなさい。

		
		//サイズを示す数値を入力し、何等かの文字で例のような三角形を表示するプログラムを作成しなさい。

		
		//サイズを示す数値を入力し、そのサイズの×印を何等かの文字で表示するプログラムを作成しなさい

		
		//フィボナッチ数列を表示するプログラムを作成しなさい。
		//最初の２つの項を 0、1 とし、1000 まで（ 1000 以下の項）を表示するものとします。
		

		
	}

}
